
<!-- header -->
```fish
plan -chdir=tf/dev/cdn -lock=false
```
<!-- fmt -->

<!-- outline -->
<details><summary>Outline of changes.</summary>

```diff
# data.aws_iam_policy_document.bucket_policy will be read during apply
# (config refers to values not yet known)
# data.aws_iam_policy_document.bucket_policy_combined will be read during apply
# (config refers to values not yet known)
+ random_string.random will be created
# module.s3_bucket.data.aws_iam_policy_document.combined[0] will be read during apply
# (config refers to values not yet known)
+ module.s3_bucket.aws_s3_bucket.this[0] will be created
+ module.s3_bucket.aws_s3_bucket_policy.this[0] will be created
+ module.s3_bucket.aws_s3_bucket_public_access_block.this[0] will be created
+ module.s3_bucket.aws_s3_bucket_website_configuration.this[0] will be created
+ module.s3_bucket_object["error.html"].aws_s3_object.this[0] will be created
+ module.s3_bucket_object["img/annnndmerlin.jpg"].aws_s3_object.this[0] will be created
+ module.s3_bucket_object["img/anothermerlin.jpg"].aws_s3_object.this[0] will be created
+ module.s3_bucket_object["img/boris.jpg"].aws_s3_object.this[0] will be created
+ module.s3_bucket_object["img/differentcat1.jpg"].aws_s3_object.this[0] will be created
+ module.s3_bucket_object["img/differentcat2.jpg"].aws_s3_object.this[0] will be created
+ module.s3_bucket_object["img/merlin.jpg"].aws_s3_object.this[0] will be created
+ module.s3_bucket_object["img/merlinagain.jpg"].aws_s3_object.this[0] will be created
+ module.s3_bucket_object["img/samson.jpg"].aws_s3_object.this[0] will be created
+ module.s3_bucket_object["img/stillmerlin.jpg"].aws_s3_object.this[0] will be created
+ module.s3_bucket_object["img/thefamily.jpg"].aws_s3_object.this[0] will be created
+ module.s3_bucket_object["img/thejudge.jpg"].aws_s3_object.this[0] will be created
+ module.s3_bucket_object["index.html"].aws_s3_object.this[0] will be created
```
</details>
<!-- main -->
<details><summary>Plan: 18 to add, 0 to change, 0 to destroy.</br>

###### OpenTofu CI by @chris3ware via [pull_request](https://github.com/3ware/aws-network-speciality/actions/runs/10793746239/job/29936394224) at 2024-09-10T13:42:20Z.
</summary>

```hcl

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

OpenTofu will perform the following actions:

  # data.aws_iam_policy_document.bucket_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "bucket_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowPublicAccessToS3Bucket"

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # data.aws_iam_policy_document.bucket_policy_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "bucket_policy_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + (known after apply),
        ]
    }

  # random_string.random will be created
  + resource "random_string" "random" {
      + id          = (known after apply)
      + length      = 12
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.s3_bucket.data.aws_iam_policy_document.combined[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = (known after apply)
    }

  # module.s3_bucket.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "cdn"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3_bucket.aws_s3_bucket_policy.this[0] will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.s3_bucket.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # module.s3_bucket.aws_s3_bucket_website_configuration.this[0] will be created
  + resource "aws_s3_bucket_website_configuration" "this" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "error.html"
        }

      + index_document {
          + suffix = "index.html"
        }
    }

  # module.s3_bucket_object["error.html"].aws_s3_object.this[0] will be created
  + resource "aws_s3_object" "this" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "error.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static/error.html"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "cdn"
        }
      + version_id             = (known after apply)
    }

  # module.s3_bucket_object["img/annnndmerlin.jpg"].aws_s3_object.this[0] will be created
  + resource "aws_s3_object" "this" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/jpeg"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "img/annnndmerlin.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static/img/annnndmerlin.jpg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "cdn"
        }
      + version_id             = (known after apply)
    }

  # module.s3_bucket_object["img/anothermerlin.jpg"].aws_s3_object.this[0] will be created
  + resource "aws_s3_object" "this" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/jpeg"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "img/anothermerlin.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static/img/anothermerlin.jpg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "cdn"
        }
      + version_id             = (known after apply)
    }

  # module.s3_bucket_object["img/boris.jpg"].aws_s3_object.this[0] will be created
  + resource "aws_s3_object" "this" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/jpeg"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "img/boris.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static/img/boris.jpg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "cdn"
        }
      + version_id             = (known after apply)
    }

  # module.s3_bucket_object["img/differentcat1.jpg"].aws_s3_object.this[0] will be created
  + resource "aws_s3_object" "this" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/jpeg"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "img/differentcat1.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static/img/differentcat1.jpg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "cdn"
        }
      + version_id             = (known after apply)
    }

  # module.s3_bucket_object["img/differentcat2.jpg"].aws_s3_object.this[0] will be created
  + resource "aws_s3_object" "this" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/jpeg"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "img/differentcat2.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static/img/differentcat2.jpg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "cdn"
        }
      + version_id             = (known after apply)
    }

  # module.s3_bucket_object["img/merlin.jpg"].aws_s3_object.this[0] will be created
  + resource "aws_s3_object" "this" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/jpeg"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "img/merlin.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static/img/merlin.jpg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "cdn"
        }
      + version_id             = (known after apply)
    }

  # module.s3_bucket_object["img/merlinagain.jpg"].aws_s3_object.this[0] will be created
  + resource "aws_s3_object" "this" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/jpeg"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "img/merlinagain.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static/img/merlinagain.jpg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "cdn"
        }
      + version_id             = (known after apply)
    }

  # module.s3_bucket_object["img/samson.jpg"].aws_s3_object.this[0] will be created
  + resource "aws_s3_object" "this" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/jpeg"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "img/samson.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static/img/samson.jpg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "cdn"
        }
      + version_id             = (known after apply)
    }

  # module.s3_bucket_object["img/stillmerlin.jpg"].aws_s3_object.this[0] will be created
  + resource "aws_s3_object" "this" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/jpeg"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "img/stillmerlin.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static/img/stillmerlin.jpg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "cdn"
        }
      + version_id             = (known after apply)
    }

  # module.s3_bucket_object["img/thefamily.jpg"].aws_s3_object.this[0] will be created
  + resource "aws_s3_object" "this" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/jpeg"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "img/thefamily.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static/img/thefamily.jpg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "cdn"
        }
      + version_id             = (known after apply)
    }

  # module.s3_bucket_object["img/thejudge.jpg"].aws_s3_object.this[0] will be created
  + resource "aws_s3_object" "this" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/jpeg"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "img/thejudge.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static/img/thejudge.jpg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "cdn"
        }
      + version_id             = (known after apply)
    }

  # module.s3_bucket_object["index.html"].aws_s3_object.this[0] will be created
  + resource "aws_s3_object" "this" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static/index.html"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "cdn"
        }
      + version_id             = (known after apply)
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + certificat_arn  = []
  + cloudfront_url  = []
  + s3_website_url  = (known after apply)

```
</details>
<!-- footer -->
<!-- tofu.34.-chdir-tf-dev-cdn.-out-tfplan -->